src/Documents/ИТСервисы_ДоговорСТехническимПровайдером/ИТСервисы_ДоговорСТехническимПровайдером.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ДоговорСТехническимПровайдером</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <registerRecords>AccumulationRegister.ИТСервисы_ДвижениеДоговоровСервисов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехПровайдер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ИТСервисы_ТипыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УслугиДоговора</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ИТСервисы_Периоды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИТСервисы_ДоговорСТехническимПровайдером/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура УслугиДоговораУслугаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.УслугиДоговора.ТекущиеДанные;
	Если ТекущиеДанные.Услуга <> Неопределено Тогда
		ТекущиеДанные.Стоимость = ПолучитьЦенуНоменклатурыНаСервере(ТекущиеДанные.Услуга, Объект.Дата);
		РассчитатьСуммуДоговора();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(Знач Номенклатура, Знач ДатаДокумента)
	Отбор = Новый Структура("Номенклатура", Номенклатура);
	ЗначенияРесурсов = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ДатаДокумента, Отбор);
	Если ЗначенияРесурсов <> Неопределено Тогда
		Возврат ЗначенияРесурсов.Цена;
	КонецЕсли;
	Возврат 0;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуДоговора()
	СуммаВсего = 0;
	Для Каждого Стр Из Объект.УслугиДоговора Цикл
		СуммаВсего = СуммаВсего + Стр.Стоимость;
	КонецЦикла;
	Объект.Сумма = СуммаВсего;
КонецПроцедуры

&НаКлиенте
Процедура УслугиДоговораСтоимостьПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДоговораПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры
